Tekla Open API Reference for Tekla Structures 2025
Phase.IsCurrentPhase Property
 The value is 1 if the phase is the current phase, 0 otherwise.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int IsCurrentPhase { get; set; }
Public Property IsCurrentPhase As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Phase Class
Tekla.Structures.Model Namespace